load-tests/vote.yml
config:
  # Point this at the server's own address, e.g. http://localhost or
  # http://<server-lan-ip>. Load tests should run from/against the
  # deployment host itself, not an external domain.
  target: "http://localhost"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 60
      name: "Ramp to event load"
  defaults:
    headers:
      content-type: "application/json"
scenarios:
  - name: "Register and vote"
    flow:
      - get:
          url: "/api/teams"
          capture:
            - json: "$[0].id"
              as: "teamId"
      - post:
          url: "/api/register"
          json:
            email: "load-{{ $randomNumber(1, 10000000) }}@company.com"
            employeeName: "Load Tester"
            teamName: "Load Team"
            teamMembers: "A, B, C"
            foodCategory: "Snacks"
            contactNumber: "9999999999"
      - post:
          url: "/api/vote"
          json:
            email: "voter-{{ $randomNumber(1, 10000000) }}@company.com"
            teamId: "{{ teamId }}"